import math

def area(r):
    '''
    Возвращает площадь круга.

    Параметры:
        r (int): радиус круга

    Возвращаемое значение:
        (float): площадь круга

    Пример вызова:
        >>> area(5)
        78.53981633974483
    '''
    return math.pi * r * r

def perimeter(r):
    '''
    Возвращает периметр (длину окружности) круга.

    Параметры:
        r (int): радиус круга

    Возвращаемое значение:
        (float): периметр круга

    Пример вызова:
        >>> perimeter(5)
        31.41592653589793
    '''
    return 2 * math.pi * r