def area(a, h):
    '''
    Возвращает площадь треугольника.

    Параметры:
        a (int/float): основание треугольника
        h (int/float): высота треугольника, проведенная к основанию

    Возвращаемое значение:
        (float): площадь треугольника

    Пример вызова:
        >>> area(4, 5)
        10.0
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

    Параметры:
        a (int/float): первая сторона треугольника
        b (int/float): вторая сторона треугольника
        c (int/float): третья сторона треугольника

    Возвращаемое значение:
        (int/float): периметр треугольника

    Пример вызова:
        >>> perimeter(3, 4, 5)
        12
    '''
    return a + b + c